Repository: ICodeTeam-Organization/Sindbad_Store_Mobile
Catalog: lib/config/l10n/app_*.arb
Languages: ar

source: Orders
ar: الطلبات

# newOrders
source: New
ar: الجديدة

# urgentOrders
source: Urgent
ar: المستعجلة

# previousOrders
source: Previous
ar: السابقة

# canceledOrders
source: Canceled
ar: الملغية

source: Profile
ar: الملف الشخصي

source: Phone Number
ar: رقم الجوال

source: Email
ar: البريد الإلكتروني

source: Country
ar: الدولة

source: Saudi Arabia
ar: السعودية

source: Change Password
ar: تغيير كلمة المرور

source: Add Products via Excel
ar: اضافة المنتجات عبر الاكسيل

source: Default Deferred Payment
ar: الدفع الآجل الافتراضي

source: Dark Mode
ar: الوضع الليلي

source: Language
ar: اللغة

source: Download Latest Version
ar: تحميل اخر اصدار

source: Logout
ar: تسجيل الخروج

source: Categories
ar: الفئات

source: Store Owner
ar: صاحب المتجر

source: Checking for updates...
ar: جاري التحقق من التحديثات...

source: App Update
ar: تحديث التطبيق

# noUpdatesAvailable
source: No updates available, you're using the latest version
ar: لا توجد تحديثات متاحة، أنت تستخدم النسخة الأحدث

source: Error
ar: خطأ

# errorCheckingUpdates
source: Error checking for updates
ar: حدث خطأ أثناء التحقق من التحديثات

# packageStatusAll
source: All
ar: الكل

# packageStatusNotApproved
source: Not yet confirmed by Yemeni accountant
ar: لم يتم التأكيد بعد من المحاسب اليمني

# packageStatusConfirmed
source: Confirmed by Yemeni accountant
ar: تم التأكيد من المحاسب اليمني

# packageStatusInvoiceCreated
source: Invoice created
ar: تم إنشاء الفاتورة

# packageStatusInvoicePaid
source: Invoice paid by Saudi accountant
ar: تم تسديد الفاتورة من قبل المحاسب السعودي

# packageStatusShipped
source: Order shipped
ar: تم تأكيد شحن الطلب

# packageStatusReceived
source: Received by Yemeni delivery
ar: تم استلام الطلب من قبل مندوب الاستلام اليمني

# packageStatusDelivered
source: Delivered to customer
ar: تم تسليم الطلب للزبون

# packageStatusCanceled
source: Order canceled
ar: إلغاء الطلب

# noData
source: No data available
ar: لا توجد بيانات

# orderNumber
source: Order No.
ar: رقم الطلب

# billNumber
source: Bill No.
ar: رقم الفاتورة

source: Item Count
ar: عدد الاصناف

source: Payment Info
ar: بيانات السداد

source: Old Password
ar: كلمة المرور القديمة

source: New Password
ar: كلمة المرور الجديدة

source: Confirm Password
ar: تأكيد كلمة المرور

source: Please fill all fields
ar: الرجاء ملء جميع الحقول

source: Passwords do not match
ar: كلمة المرور غير متطابقة

# passwordRequirements
source: Password must be at least 9 characters and contain at least one letter and one number
ar: يجب أن تكون كلمة المرور على الأقل 9 حروف، ويجب أن تحتوي على حرف واحد على الأقل و رقم واحد على الأقل

source: This field is required
ar: هذا الحقل مطلوب

source: Type here...
ar: أكتب هنا...

# errorMessage
source: An error occurred. Please try again later
ar: هناك خطأ الرجاء المحاولة لاحقاً

source: Products
ar: المنتجات

source: Offers
ar: العروض

source: Reports
ar: التقارير

# allProducts
source: All
ar: الجميع

source: With Offers
ar: عليها عروض

source: Stopped
ar: الموقوفة

source: Add Products
ar: أضافة منتجات

source: Stop Products
ar: ايقاف منتجات

source: Something went wrong...
ar: هناك خطأ ما...

source: OK
ar: حسنا

# productNumber
source: Product No:
ar: رقم المنتج:

source: Price:
ar: السعر:

# currency
source: SAR
ar: ريال

source: Edit
ar: تعديل

source: Delete
ar: حذف

source: Delete Product
ar: حذف المنتج

# deleteProductConfirm
source: Are you sure you want to delete this product?
ar: هل انت متأكد من حذف المنتج

# deleteProductPermanent
source: This product will be permanently deleted
ar: سيتم حذف هذا المنتج بشكل نهائي

source: Add Product
ar: إضافة منتج

# productInfo
source: Product Information
ar: معلومات المنتج

source: Product Name
ar: أسم المنتج

# priceLabel
source: Price
ar: السعر

# productNumberLabel
source: Product Number
ar: رقم المنتج

source: Old Price
ar: السعر السابق

source: Short Description
ar: وصف مختصر

source: Select Product Image
ar: أختر صورة المنتج

source: Select Category
ar: أختر الفئة

# selectCategoryHint
source: Choose the appropriate category
ar: قم بإختيار الفئة المناسبة

source: Select Section
ar: أختر القسم

# selectSectionHint
source: Choose the appropriate section
ar: قم بإختيار القسم المناسب

# selectCategoryFirst
source: Select main category first
ar: إختر الفئة الأساسية أولا

source: Select Brand
ar: أختر اسم البراند

# selectBrandHint
source: Choose the appropriate brand
ar: قم بإختيار البراند المناسب

source: Product Attributes
ar: خصائص المنتج

source: Attribute
ar: خاصية

source: Value
ar: قيمة

source: Add More
ar: أضف المزيد

source: Confirm
ar: تأكيد

source: Cancel
ar: الغاء

# productAddedSuccess
source: Product added successfully!
ar: تم إضافة المنتج بنجاح!

# productAddFailed
source: Failed to add product, please try again
ar: فشل في إضافة المنتج, الرجاء المحاولة مرة أخرى

source: Add Image
ar: إضافة صورة

# noCancelOperation
source: No, Cancel the operation
ar: لا, إلغاء العملية

source: Yes, continue process
ar: نعم, متابعة الحذف

source: Reactivate
ar: إعادة تنشيط

source: Reactivate Products
ar: إعادة تنشيط المنتجات

source: Add Offer
ar: اضافة عرض

# offerInfo
source: Offer Information
ar: معلومات العرض

source: Offer Name
ar: اسم العرض

source: Offer Start
ar: بداية العرض

source: Offer End
ar: نهاية العرض

source: Select Products
ar: اختر المنتجات

source: Browse Products
ar: تصفح المنتجات

source: Add products to offer
ar: اضف منتجات للعرض

# invalidDateFormat
source: Invalid date format. Please check the dates.
ar: صيغة التاريخ غير صحيحة. من فضلك تحقق من التواريخ.

source: Yes, change status
ar: نعم , قم بتغيير الحالة

# confirmChangeOfferStatus
source: Are you sure you want to change the offer status?
ar: هل انت متأكد من تغيير حالة العرض ؟

# confirmDeleteOffer
source: Are you sure you want to delete?
ar: هل انت متأكد من الحذف ؟

# offerWillBeDeleted
source: This offer will be deleted, do you want to continue?
ar: سيتم حذف هذا العرض, هل تريد المتابعة

# offerAddedSuccess
source: Offer added successfully
ar: تمت إضافة العرض بنجاح

# noOffersYet
source: You haven't added any offers yet!
ar: لم تضف اي عروض حتى الان!

# encourageCustomers
source: Encourage your customers to buy by offering attractive offers
ar: شجع عملائك على الشراء بتقديم عروض مغرية

# errorTryAgainLater
source: An error occurred. Please try again later
ar: هناك خطأ الرجاء المحاولة لاحقاً

# infoNotFetched
source: Information could not be retrieved!!
ar: لم يتم جلب المعلومات!!

source: Discount Type
ar: نوع الخصم

# discountAmount
source: Discount amount from product
ar: خصم مبلغ من منتج

source: Buy X get Y
ar: اشتري x واحصل على y

source: Default Value
ar: القيمة الأفتراضية

source: Add Offer Products
ar: اضافة منتجات العرض

# searchProductNumberOrName
source: Search by product number or name
ar: بحث عن رقم المنتج او اسمه

# infoNotReached
source: Could not access the information
ar: لم يتم الوصول الى المعلومات
